Repository: kodi-game/game.libretro.snes9x
Catalog: game.libretro.snes9x/resources/language/resource.language.*/strings.po
Languages: ga

# Addon Description
source: Snes9x is a portable, freeware SNES and Super Famicom emulator.[CR][CR]Snes9x is coded in C++, with three assembler CPU emulation cores on the i386 Linux and Windows ports.
ga: Is éard atá i SNES9X ná aithriseoir iniompartha, freeware SNES agus Super Famicom.

# Addon Disclaimer
source: The Snes9X team is not connected or affiliated with any mentioned company in any way. The opinions of the Snes9X team do not reflect the views of the various companies mentioned here. Companies and all products pertaining to that company are trademarks of that company. Please contact that company for trademark and copyright information.
ga: Níl foireann SNES9X ceangailte ná cleamhnaithe le haon chuideachta a luaitear ar bhealach ar bith. Ní léiríonn tuairimí fhoireann SNES9X tuairimí na gcuideachtaí éagsúla a luaitear anseo. Is trádmharcanna den chuideachta sin iad cuideachtaí agus na táirgí go léir a bhaineann leis an gcuideachta sin. Téigh i dteagmháil leis an gcuideachta sin le haghaidh faisnéise trádmhairc agus cóipchirt.

# #30001
source: Console Region (Reload Core)
ga: Réigiún Console (Croí -Athlódáil)

# #30002
source: Preferred Aspect Ratio
ga: Cóimheas Gné is Fearr

# #30003
source: Crop Overscan
ga: Barr overscan

# #30004
source: Hi-Res Blending
ga: HI-Res Cumasc

# #30005
source: Blargg NTSC Filter
ga: Scagaire Blargg NTSC

# #30006
source: Audio Interpolation
ga: Idirshuíomh fuaime

# #30007
source: Allow Opposing Directions
ga: Ceadaigh Treoracha Codarsnacha

# #30008
source: SuperFX Overclocking
ga: Overclocking Superfx

# #30009
source: Reduce Slowdown (Hack, Unsafe)
ga: Laghdaigh moilliú (hack, neamhshábháilte)

# #30010
source: Reduce Flickering (Hack, Unsafe)
ga: Laghdaigh flickering (hack, neamhshábháilte)

# #30011
source: Randomize Memory (Unsafe)
ga: Cuimhne randamaithe (neamhshábháilte)

# #30012
source: Block Invalid VRAM Access
ga: Bloc rochtain neamhbhailí VRAM

# #30013
source: Echo Buffer Hack (Unsafe, only enable for old addmusic hacks)
ga: Hack maolánach macalla (neamhshábháilte, gan a bheith ar chumas ach sean -hacks breise)

# #30014
source: Light Gun Mode
ga: Mód Gunna Solais

# #30015
source: Super Scope Reverse Trigger Buttons
ga: Cnaipí truicir droim ar ais ag scóip Super

# #30016
source: Super Scope Crosshair
ga: Super scóip Crosshair

# #30017
source: Super Scope Color
ga: Dath scóip Super

# #30018
source: Justifier 1 Crosshair
ga: Údar a thabhairt le 1 chrosaire

# #30019
source: Justifier 1 Color
ga: Údar 1 dath a chosaint

# #30020
source: Justifier 2 Crosshair
ga: Údar a thabhairt le 2 chrosaire

# #30021
source: Justifier 2 Color
ga: Údar 2 dhath

# #30022
source: M.A.C.S. Rifle Crosshair
ga: M.A.C.S. Crosair Raidhfil

# #30023
source: M.A.C.S. Rifle Color
ga: M.A.C.S. Dath raidhfil

# #30024
source: Show Layer 1
ga: Taispeáin Sraith 1

# #30025
source: Show Layer 2
ga: Taispeáin Sraith 2

# #30026
source: Show Layer 3
ga: Taispeáin Sraith 3

# #30027
source: Show Layer 4
ga: Taispeáin Sraith 4

# #30028
source: Show Sprite Layer
ga: Taispeáin ciseal sprite

# #30029
source: Enable Graphic Clip Windows
ga: Cumasaigh Windows Gearrthóg Ghrafach

# #30030
source: Enable Transparency Effects
ga: Éifeachtaí trédhearcachta a chumasú

# #30031
source: Enable Sound Channel 1
ga: Cumasaigh cainéal fuaime 1

# #30032
source: Enable Sound Channel 2
ga: Cumasaigh cainéal fuaime 2

# #30033
source: Enable Sound Channel 3
ga: Cumasaigh cainéal fuaime 3

# #30034
source: Enable Sound Channel 4
ga: Cumasaigh cainéal fuaime 4

# #30035
source: Enable Sound Channel 5
ga: Cumasaigh cainéal fuaime 5

# #30036
source: Enable Sound Channel 6
ga: Cumasaigh cainéal fuaime 6

# #30037
source: Enable Sound Channel 7
ga: Cumasaigh cainéal fuaime 7

# #30038
source: Enable Sound Channel 8
ga: Cumasaigh cainéal fuaime 8
